Repository: sslavik/acdat
Catalog: TMXParser/en-es.tmx
Source language: en
Languages: es

source: sybase_result() returns the contents of one cell from a Sybase result set.
es: sybase_result() devuelve el contenido de una celda de un conjunto de resultados de Sybase.

source: The field argument can be the field' s offset, or the field's name, or the field's table dot field's name (tablename.fieldname).
es: El parámetro field puede ser el offset del campo, o el nombre del campo, o el nombre de la tabla, un punto y el nombre del campo (nombre_tabla.nombre_campo).

source: As these functions return the contents of multiple cells in one function call, they' re MUCH quicker than sybase_result().
es: Ya que estas funciones devuelven el contenido de multiples celdas en una única llamada, son MUCHO más rápidas que sybase_result().

source: Recommended high-performance alternatives: sybase_fetch_row(), sybase_fetch_array(), and sybase_fetch_object().
es: Alternativas recomendadas para alto rendimiento: sybase_fetch_row(), sybase_fetch_array(), y sybase_fetch_object().

source: sybase_select_db() sets the current active database on the server that's associated with the specified link identifier.
es: sybase_select_db() establece como activa la base de datos en el servidor asociada con el identificador de enlace especificado.

source: If no link is open, the function will try to establish a link as if sybase_connect() was called, and use it.
es: Si no hay un enlace abierto, la función intentará establecer un enlace como si sybase_connect() fuese llamada, y lo usará.

source: Every subsequent call to sybase_query() will be made on the active database.
es: Cada llamada subsiguiente a sybase_query() será hecha en la base de datos activa.

source: See also: sybase_connect(), sybase_pconnect(), and sybase_query()
es: Vea también: sybase_connect(), sybase_pconnect(), y sybase_query()

source: symlink() creates a symbolic link from the existing target with the specified name link.
es: symlink() crea un enlace simbólico del objetivo target con el nombre especificado por link.

source: See also link() to create hard links, and readlink() along with linkinfo().
es: Ver también link() para crear enlaces fuertes, y readlink() junto con linkinfo().

source: syslog() generates a log message that will be distributed by the system logger. priority is a combination of the facility and the level, values for which are given in the next section.
es: syslog() genera un mensaje que será distribuido por el logger del sistema. priority es una combinación de la facility y el level, los valores se indicarán en la sección siguiente.

source: Table 1. syslog() Priorities (in descending order)
es: El argumento restante es el mensaje a enviar, excepto que los dos caracteres %m sean reemplazados por la cadena de error (strerror) correspondiente al valor actual de errno.

source: See also define_syslog_variables(), openlog() and closelog().
es: En Windows NT, el servicio syslog es emulado usando el Log de Eventos.

source: system() is just like the C version of the function in that it executes the given command and outputs the result.
es: system() se parece a la versión C de la función de mismo nombre en que ejecuta la orden indicada en command y muestra el resultado.

source: The system() call also tries to automatically flush the web server's output buffer after each line of output if PHP is running as a server module.
es: Devuelve la última línea de la orden en caso de éxito, y falso en caso de fallo.

source: If you need to execute a command and have all the data from the command passed directly back without any interference, use the passthru() function.
es: Si necesita ejecutar una orden y obtener de vuelta todo los datos del mismo sin interferencias, use la función PassThru().

source: See also exec(), passthru(), popen(), escapeshellcmd(), and the backtick operator.
es: Véase también exec(), PassThru(), popen(), EscapeShellCmd(), y el operador ` (apóstrofe invertido).

source: See also atan(), sin(), cos() and deg2rad().
es: Vea también sin() y cos().

source: Creates a file with a unique filename in the specified directory.
es: Crea un fichero temporal de nombre único en el directorio especificado.

source: If the directory does not exist, tempnam() may generate a file in the system's temporary directory, and return the name of that.
es: Si el directorio no existe tempnam() puede generar un fichero en el directorio temporal del sistema.

source: Prior to PHP 4.0.6, the behaviour of the tempnam() function was system dependent.
es: El comportamiento de la función tempnam() depende del sistema.

source: Consult your system documentation on the tempnam( 3) function if in doubt.
es: En Windows la variable de entorno TMP se impone sobre el parámetro dir, en Linux la variable de entorno TMPDIR tiene preferencia, mientras que en SVR4 siempre se usará el parámetro dir si si el directorio al que apunta existe.

source: Example 1. tempnam() example
es: Consulta la documentación del sistema sobre la función tempnam( 3) en caso de duda.

source: This function 's behavior changed in 4.0.3.
es: Ejemplo 1.

source: Note, that you need to remove the file in case you need it no more, it is not done automatically.
es: Ejemplo de tempnam()

source: See also tmpfile() and unlink().
es: $tmpfname = tempnam ("/ tmp", "FOO");

source: This function sets the domain to search within when calls are made to gettext(), usually the named after an application.
es: Esta función establece el dominio en el que se realizarán las busquedas provocadas por las llamadas a gettext(), normalmente el nombre dado a la aplicación.

source: The previous default domain is returned.
es: Se devuelve el dominio anterior.

source: Call it with NULL as parameter to get the current setting without changing it.
es: Puede llamar a la función sin parámetros para obtener el dominio actual sin necesidad de cambiarlo.

source: Returns the current time measured in the number of seconds since the Unix Epoch (January 1 1970 00:00:00 GMT).
es: Devuelve la hora actual como número de segundos transcurridos desde las 00:00:00 del 1 de enero de 1970 GMT (Unix Epoch).

source: See also date().
es: Ver también date().

source: dBase functions
es: Funciones para dBase

source: Example 1. tmpfile() example
es: Ejemplo 1. tmpfile() example

source: This is equivalent to what utime (sometimes referred to as utimes) does.
es: Trata de fijar la fecha de modificación del fichero indicado por filename al valor dado por time.

source: Note that the access time is always modified, regardless of the number of parameters.
es: Si no se pone la opción time, se utiliza la fecha actual.

source: if (touch ($FileName)) {print "$FileName modification time has been changed to todays date and time";} else {print "Sorry Could Not change modification time of $FileName";}
es: Devuelve TRUE en caso de éxito y FALSE en otro caso.

source: Without the second parameter, trim() will strip these characters:
es: Esta función elimina los espacios en blanco del comienzo y del final de una cadena y devuelve el resultado.

source: The comparison function is user-defined.
es: Esta función ordena una matriz de modo que los índices de la misma mantengan su correlación con los elementos a los que están asociados.

source: Please see usort() and uksort() for examples of user-defined comparison functions.
es: Esto se utiliza principalmente para ordenar matrices asociativas en las que el orden de los elementos es importante.

source: See also usort(), uksort(), sort(), asort(), arsort(), ksort(), and rsort().
es: La función de comparación viene definida por el usuario.

source: Returns a string with the first character of str capitalized, if that character is alphabetic.
es: Pone en mayúsculas el primer carácter de cad si es alfabético.

source: Example 1. ucfirst() example
es: Ejemplo de ucfirst()

source: $foo = 'hello world !'; $foo = ucfirst($foo); / / Hello world! $bar = 'HELLO WORLD !'; $bar = ucfirst($bar); / / HELLO WORLD! $bar = ucfirst(strtolower($bar)); / / Hello world!
es: Susanita tiene un / / ratón, un ratón chiquitín.

source: See also strtolower(), strtoupper(), and ucwords().
es: Vea también strtoupper() y strtolower()

source: Returns a string with the first character of each word in str capitalized, if that character is alphabetic.
es: Pasa a mayúsculas la primera letra de cada palabra en cad si dicho caracter es alfabético.

source: Example 1. ucwords() example
es: Ejemplo 1.

source: The definition of a word is any string of characters that is immediately after a whitespace (These are: space, form-feed, newline, carriage return, horizontal tab, and vertical tab).
es: Susanita Tiene Un / / Ratón, Un Ratón Chiquitín.

source: See also strtoupper(), strtolower() and ucfirst().
es: Vea también strtoupper(), strtolower() y ucfirst().

source: This function will sort the keys of an array using a user-supplied comparison function.
es: Esta función ordenará las claves de una matriz utilizando una función de comparación suministrada por el usuario.

source: If the array you wish to sort needs to be sorted by some non-trivial criteria, you should use this function.
es: Si la matriz a ordenar necesita utilizar un criterio poco trivial, esta es la función que deberá usar.

source: Example 1. uksort() example
es: Ejemplo de uksort()

source: function cmp ($a, $b) {if ($a == $b) return 0; return ($a $b)? -1:
es: function micomparar ($a, $b) {if ($a == $b) return 0; return ($a $b)? -1:

source: See also usort(), uasort(), sort(), asort(), arsort(), ksort(), natsort(), and rsort().
es: Vea también: arsort(), asort(), uasort(), ksort(), rsort(), y sort().

source: umask() sets PHP's umask to mask 0777 and returns the old umask.
es: umask() fija las umask PHP con la mascara 0777 y y devuelve la antigua umask.

source: When PHP is being used as a server module, the umask is restored when each request is finished.
es: Cuando PHP se está usando como un módulo del servidor, la umask se restaura cuando cada petición es finalizada.

source: umask() without arguments simply returns the current umask.
es: umask() sin argumentos sólamente devuelve la umask actual.

source: uniqid() returns a prefixed unique identifier based on the current time in microseconds.
es: uniqid() devuelve un identificador único con un prefijo basado en la hora actual en microsegundos.

source: Prefix can be up to 114 characters long.
es: El prefijo puede ser práctico por ejemplo si se generan identificadores simultáneamente en varios host que pueden haber generado el identificador en el mismo microsegundo. prefix (prefijo) puede ser de hasta 114 carácteres de longitud.

source: If the optional lcg parameter is TRUE, uniqid() will add additional "combined LCG "entropy at the end of the return value, which should make the results more unique.
es: Si el parámetro opcional lcg es TRUE, uniqid() añadirá entropía "LCG combinada "al final del valor devuelto, que hará el resultado más único.

source: With an empty prefix, the returned string will be 13 characters long.
es: Con un prefix Con un prefix (prefijo) vacío, la cadena devuelta tendrá una longitud de 13 carácteres.

source: If lcg is TRUE, it will be 23 characters.
es: Si lcg es TRUE, tendrá 23 carácteres.

source: The lcg parameter is only available in PHP 4 and PHP 3.0.13 and later.
es: El parámetro lcg está disponible sólo en PHP 4 y PHP 3.0.13 y posteriores.

source: If you need a unique identifier or token and you intend to give out that token to the user via the network (i.e. session cookies), it is recommended that you use something along the lines of
es: Si necesita un identificador único o testigo, y tiene la intención de hacer público ese testigo al usuario por medio de una red (i.e. cookies de sesión) se recomienda que utilice algo parecido a estas líneas

source: $token = md5( uniqid("")); / / no prefix $better_token = md5(uniqid(rand(),1)); / / better, difficult to guess
es: $token = md5( uniqid("")); / / no random portion $better_token = md5(uniqid(rand())); / / better, difficult to guess

source: This will create a 32 character identifier (a 128 bit hex number) that is extremely difficult to predict.
es: Esto creará un identificador de 32 carácteres (un número hexadecimal de 128 bits) que es extremadamente difícil de predecir.

source: Return the Julian Day for a UNIX timestamp (seconds since 1.1.1970), or for the current day if no timestamp is given.
es: Devuelve el dia Juliano correspondiente a un UNIX timestamp (segundos desde 01.01.1970), ó al dia actual si no se especifica timestamp

source: Deletes filename.
es: Borra el fichero filename.

source: Similar to the Unix C unlink() function.
es: Es similar a la función unlink() del Unix C.

source: See also rmdir() for removing directories.
es: Ver también rmdir() para borrar directorios.

source: Forms Data Format functions
es: Funciones Forms Data Format (Formato de Datos de Formularios)

source: unpack() from binary string into array according to format.
es: Desempaqueta datos de una cadena binaria en un array, de acuerdo al formato format.

source: Returns array containing unpacked elements of binary string.
es: Devuelve un array que contiene los elementos de la cadena binaria desempaquetados.

source: unpack() works slightly different from Perl as the unpacked data is stored in an associative array.
es: Unpack funciona de manera ligeramente diferente a Perl, ya que los datos desempaquetados se almacenan en un array asociativo.

source: To accomplish this you have to name the different format codes and separate them by a slash /.
es: Para conseguir ésto debe nombrar los diferentes códigos de formato y separarlos por una barra inclinada /.

source: Example 1. unpack() format string
es: Ejemplo 1. cadena de formato unpack

source: The resulting array will contain the entries "chars1", "chars2" and "int ".
es: El array resultante contendrá las entradas "chars1", "chars2" y "int ".

source: For an explanation of the format codes see also: pack()
es: Para una explicación de los códigos de formato véase también: pack()

source: Note that PHP internally stores integral values as signed.
es: Advierta que PHP almacena internamente los valores enteros con signo.

source: If you unpack a large unsigned long and it is of the same size as PHP internally stored values the result will be a negative number even though unsigned unpacking was specified.
es: Si desempaqueta un unsigned long (largo sin signo) demasiado grande y es del mismo tamaño tal como PHP almacena internamente los valores, el resultado será un número negativo a pesar de que se especificara desempaquetamiento sin signo.

source: Example 1. unserialize_callback_func example
es: Ejemplo 1. unserialize_callback_func example

source: Example 2. unserialize() example
es: Ejemplo 2. unserialize() example

source: As such no value is returned, and attempting to take the value of unset() results in a parse error.
es: unset() destruye la variable especificada y devuelve TRUE.

source: The behavior of unset() inside of a function can vary depending on what type of variable you are attempting to destroy.
es: Ejemplo 1.

source: The variable in the calling environment will retain the same value as before unset() was called.
es: Ejemplo de unset()

source: function foo( $bar) {unset($bar); $bar = "blah";} $bar = 'something'; echo "$bar\n"; foo($bar); echo "$bar\n";
es: unset( $foo); unset ($bar['quux']);

# function foo() {static $a; $a++; echo "$a "; unset($a);} foo(); foo(); foo();
source: function foo() {static $a; $a++; echo "$a\n"; unset($a);} foo(); foo(); foo();
es: Ver también isset() y empty().

source: Decodes any% ## encoding in the given string.
es: Decodifica cualquier% ## cifrado en la cadena dada.

source: The decoded string is returned.
es: Se devuelve la cadena decodificada.

source: Example 1. urldecode() example
es: Ejemplo urldecode()

source: $a = explode( '', $QUERY_STRING); $i = 0; while ($i count($a)) {$b = split('=', $a[$i]); echo'Value for parameter ', htmlspecialchars(urldecode($b[0])),' is', htmlspecialchars(urldecode($b[1])), "br / \n"; $i++;}
es: $a = split ('', $querystring); $i = 0; while ($i count ($a)) {$b = split ('=', $a [$i]); echo 'El valor para el parámetro ', htmlspecialchars (urldecode ($b [0])),' es ', htmlspecialchars (urldecode ($b [1])), "BR"; $i++;}

source: See also urlencode(), rawurlencode(), rawurldecode().
es: Vea también urlencode()

source: It is encoded the same way that the posted data from a WWW form is encoded, that is the same way as in application / x-www-form-urlencoded media type.
es: Devuelve una cadena en la que todos los carácteres no alfanuméricos excepto -_. han sido reemplazados con un signo de porcentaje (%) seguido por dos dígitos hexadecimales y los espacios han sido codificados como signos positivos (+).

source: This function is convenient when encoding a string to be used in a query part of an URL, as a convenient way to pass variables to the next page:
es: Está codificado de la misma manera que los datos que se envian desde un formulario WWW, es decir de la misma forma que el tipo application / x-www-form-urlencoded.

source: echo 'a href="mycgi?foo=', urlencode($userinput),' "';
es: Esto difiere del cifrado RFC1738 (vea rawurlencode()) en el que por razones históricas, los espacios son codificados como signos positivos (+).

source: This is an obvious hassle that the W3C has been telling people about for years.
es: Esta función es conveniente para codificar una cadena de texto que va a ser usada como parte de una consulta de una URL, y es una forma adecuada de pasar variables a la página siguiente:

source: Unfortunately most user agents do not send form data in this semi-colon separated format.
es: Ejemplo 1.

source: You don' t need to change PHP's arg_separator for this.
es: Ejemplo urlencode()

source: Example 2. urlencode / htmlentities() example
es: echo 'A HREF="mycgi?foo=', urlencode ($userinput),' "';

source: See also urldecode(), htmlentities(), rawurldecode(), rawurlencode().
es: Vea también urldecode()

source: Variable Functions
es: Funciones sobre variables

source: See also sleep() and set_time_limit().
es: La función usleep retrasa la ejecución del programa durante un número de micro_seconds (microsegundos) dado.

source: Up to PHP 4.0.6 the user defined functions would keep the original order for those elements, but with the new sort algorithm intruduced with 4.1.0 this is no longer the case as there is no solution to do so in an efficient way.
es: La función de comparación deberá devolver un entero menor, igual, o mayor que cero, si el primer argumento se considera respectivamente menor que, igual que, o mayor que el segundo.

source: 1;} $a = array (3, 2, 5, 6, 1); usort ($a, "cmp"); while (list ($key, $value) = each ($a)) {echo "$key: $value\n";}
es: Si dos miembros resultan ser iguales, su orden en la matriz ordenada será cualquiera.

source: Example 2. usort() example using multi-dimensional array
es: 1;} $a = array (3, 2, 5, 6, 1); usort ($a, cmp); while (list ($clave, $valor) = each ($a)) {echo "$clave: $valor\n";}

source: When sorting a multi-dimensional array, $a and $b contain references to the first index of the array.
es: Nota:

source: $fruits[ 0]: apples $fruits[1]: grapes $fruits[2]: lemons
es: Obviamente en este caso trivial la función rsort() habría sido más apropiada.

source: Example 3. usort() example using a member function of an object
es: Aviso

source: See also uasort(), uksort(), sort(), asort(), arsort(), ksort(), natsort(), and rsort().
es: Vea también: arsort(), asort(), ksort(), rsort() y sort().

source: This function decodes data, assumed to be UTF-8 encoded, to ISO-8859-1.
es: Esta función decodifica data, asume codificación UTF-8, a ISO-8859-1.

source: See utf8_encode() for an explaination of UTF-8 encoding.
es: Mira utf8_encode() para una explicación de codificación UTF-8.

source: XML parser functions
es: Funciones de intérprete XML

source: This function encodes the string data to UTF-8, and returns the encoded version.
es: Esta función codifica la cadena data a UTF-8, y devuelve la versión codificada.

source: UTF-8 is a standard mechanism used by Unicode for encoding wide character values into a byte stream.
es: UTF-8 es un mecanismo estándar usado por Unicode para codificar valores de caracteres amplios en un chorro de bytes.

source: UTF-8 is transparent to plain ASCII characters, is self-synchronized (meaning it is possible for a program to figure out where in the bytestream characters start) and can be used with normal string comparison functions for sorting and such.
es: UTF-8 es transparente a caracteres de ASCII plano, es auto-sincronizado (significa que es posible para un programa averiguar dónde comienzan los caracteres en el chorro de bytes) y se puede usar con funciones de comparación de cadenas normales para ordenar y otros fines.

source: PHP encodes UTF-8 characters in up to four bytes, like this:
es: PHP codifica caracteres UTF-8 en hasta cuatro bytes, como esto:

source: UTF-8 encoding
es: Codificación UTF-8

source: representation
es: representación

source: Example 1. var_dump() example
es: Ejemplo 1. var_dump() example

source: Example 1. version_compare() Example
es: Ejemplo 1. version_compare() Example

source: It performs an Apache sub-request.
es: virtual() es una función específica del Apache que es equivalente a !--#include virtual...- - en mod_include.

source: Note that for a CGI script, the script must generate valid CGI headers.
es: Esto ejecuta una sup-petición al Apache .Esto, es util para incluir CGI-scripts o páginas .shtml o cualquier tipo de fichero que puedas procesar mediante el Apache.

source: At the minimum that means it must generate a Content-type header.
es: Los CGI-scripts deberán generar cabeceras válidas.

source: To run the sub-request, all buffers are terminated and flushed to the browser, pending headers are sent too.
es: Esto, implica como mínimo un include() ó un require(); La función virtual() no puede ser usada para incluir un documento que sea por si mismo un documento PHP.

source: WDDX Functions
es: Funciones WDDX

source: wddx_add_vars() is used to serialize passed variables and add the result to the packet specified by the packet_id.
es: wddx_add_vars() se utiliza para serializar las variables dadas e incorporar el resultado al paquete especificado por packet_id.

source: The variables to be serialized are specified in exactly the same way as wddx_serialize_vars().
es: Las variables a serializar se especifican exactamente igual que en wddx_serialize_vars().

source: wddx_deserialize() takes a packet string and deserializes it.
es: wddx_deserialized() toma una cadena packet y la desserializa.

source: It returns the result which can be string, number, or array.
es: Devuelve el resultado que puede ser de tipo cadena, numerico o array.

source: Note that structures are deserialized into associative arrays.
es: Las estructuras son desserializadas en forma de arrays asociativos.

source: wddx_packet_end() ends the WDDX packet specified by the packet_id and returns the string with the packet.
es: wddx_packet_end() finaliza el paquete WDDX especificado por el packet_id y devuelve la cadena con el paquete.

source: Use wddx_packet_start() to start a new WDDX packet for incremental addition of variables.
es: Utilice wddx_packet_start() para comenzar un nuevo paquete WDDX que permita la adicion sucesiva de variables.

source: It takes an optional comment It takes an optional comment string and returns a packet ID for use in later functions.
es: Recibe el parametro opcional comentario y devuelve un identificador de paquete para su uso en posteriores llamadas.

source: It automatically creates a structure definition inside the packet to contain the variables.
es: Automaticamente define una estructura dentro del paquete para contener las variables.
